# AlignmentStationLabelSetOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabelSetOptions Class
Members See Also
---
Represents an object containing options for creating a set of AlignmentStationLabel.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public class AlignmentStationLabelSetOptions
```

Visual Basic
---
```text
Public Class AlignmentStationLabelSetOptions
```

Visual C++
---
```text
public ref class AlignmentStationLabelSetOptions
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Infrastructure..::..AlignmentStationLabelSetOptions
# See Also
AlignmentStationLabelSetOptions Members
Autodesk.Revit.DB.Infrastructure Namespace